<?php
/**
 * 错误信息
 * Created by PhpStorm.
 * User: qzc
 * Date: 2017/12/11
 * Time: 下午5:31
 */
return [
    // 公共信息
    10000 => '操作成功',
    10001 => '操作失败',
    10002 => '系统维护中',
    40000 => '非法请求',
    40001 => '用户登录信息过期',
    40002 => '权限不足,操作禁止',
    40003 => '参数错误',
    40004 => '参数丢失',
    40005 => '添加成功',
    40006 => '添加失败',
    40007 => '更新成功',
    40008 => '更新失败',
    40009 => '删除成功',
    40010 => '删除失败',
    40011 => '当前数据不存在',
    40012 => '上传图片到本地失败',
    40013 => '上传图片到本地失败',
    40014 => '用户已登陆',
    40015 => '游客状态不可操作',
    40016 => '游客状态不可操作，请关注微信公众号“酒商圈”，注册体验更多操作',
    40017 => '请先进行实名认证',
    40018 => '获取成功',
    40019 => '获取失败',
    40020 => '设置成功',
    40021 => '设置失败',
    40022 => '请选择导出时间',

    // 登录
    40101 => '账号不存在',
    40102 => '账号密码不正确',
    40103 => '登录成功',


    // 出库
    40201 => '输入的箱码至少为18位',
    40202 => '商户不存在',
    40203 => '创建出库单失败',
    40204 => '箱码为24位',
    40205 => '创建出库箱码数据失败',
    40206 => '创建出库商品数据失败',
    40207 => '出库失败',
    40208 => '出库码参数格式不正确',
    40209 => '出库成功',


    // 公告
    40301 => '暂无可同步数据',


    // 商户
    40901 => '商户已存在',
    40902 => '新建商户成功',
    40903 => '新建商户失败',
];